app/views/scores/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  <% if current_user.admin or current_user.prof %>
      <% @scores.each do |score| @user1 = User.find(id=score.user_id) %>