app/views/show/admins.html.erb

  <tbody>
  <% @users = User.all %>
---
SELECT "users".* FROM "users"