app/controllers/exams_controller.rb

SELECT "exams".* FROM "exams"
---
  def index
    @exams = Exam.all

INSERT INTO "exams" ("name", "date", "prof", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MST-Contrôle"], ["date", "28/04/2017"], ["prof", "Perinel"], ["created_at", 2017-05-02 14:48:43 UTC], ["updated_at", 2017-05-02 14:48:43 UTC]]
---
  def create
    @exam = Exam.new(exam_params)

    respond_to do |format|
      if @exam.save

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_exam
      @exam = Exam.find(params[:id])