app/controllers/notes_controller.rb

INSERT INTO "notes" ("titre", "created_at", "updated_at") VALUES (?, ?, ?)  [["titre", "Programmation Web"], ["created_at", 2017-04-30 19:20:41 UTC], ["updated_at", 2017-04-30 19:20:41 UTC]]
---
  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save