app/controllers/profs_controller.rb

SELECT "profs".* FROM "profs"
---
  def index
    @profs = Prof.all