app/controllers/scores_controller.rb

  def create
    sleep 5
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save
---
INSERT INTO "scores" ("student", "exam", "result", "prof", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["student", "LIU Hao"], ["exam", "IPA-TPnoté"], ["result", 12], ["prof", "Genaud"], ["date", "12/04/2017"], ["created_at", 2017-05-02 14:36:07 UTC], ["updated_at", 2017-05-02 14:36:07 UTC]]

  def destroy
    @score.destroy
---
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 2]]