app/controllers/students_controller.rb

INSERT INTO "students" ("email", "password", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "liuhaoxdu@outlook.com"], ["password", "liuhaoensiie"], ["first_name", "Hao"], ["last_name", "LIU"], ["created_at", 2017-05-03 09:10:03 UTC], ["updated_at", 2017-05-03 09:10:03 UTC]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save