app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "prof", "begin", "end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "IPW"], ["prof", "Kils"], ["begin", "25/02/2017"], ["end", "20/05/2017"], ["created_at", 2017-05-02 14:45:10 UTC], ["updated_at", 2017-05-02 14:45:10 UTC]]