app/controllers/subjets_controller.rb

  def index
    @subjets = Subjet.all
---
SELECT "subjets".* FROM "subjets"

  def create
    @subjet = Subjet.new(subjet_params)

    respond_to do |format|
      if @subjet.save
---
INSERT INTO "subjets" ("titre", "periode", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titre", "IPQ"], ["periode", 2017-04-30 19:45:00 UTC], ["created_at", 2017-04-30 19:45:54 UTC], ["updated_at", 2017-04-30 19:45:54 UTC]]

    def set_subjet
      @subjet = Subjet.find(params[:id])
---
SELECT  "subjets".* FROM "subjets" WHERE "subjets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]