app/views/exams/index.html.erb

    <% @exams.each do |exam| @subject = Subject.find(id=exam.subject_id)  %>
      <% @user=User.find(id=@subject.user_id)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]